000100* HELLO.COB GNU Cobol FAQ example
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. hello.
000310 DATA DIVISION.
000320 WORKING-STORAGE SECTION.
000330 01 VAL1 PIC x(10).
000340 01 VAL2 PIC x(10).
000400 PROCEDURE DIVISION.
000500     DISPLAY "Hello, World!".
000510     ACCEPT VAL1 FROM CONSOLE.
000510     ACCEPT VAL2 FROM CONSOLE.
000520     DISPLAY "VAL1=" VAL1.
000530     DISPLAY "VAL2=" VAL2.
000600     STOP RUN.
